using System;
using System.Collections;
using System.Globalization;
using System.Text;
using System.Text.RegularExpressions;
using System.Threading;
using System.Linq;
namespace DotNet.Utilities
{
   

    /*
 * ¹¦ÄÜÃèÊö£ººº×Ö×ª»»Ïà¹ØÀà
 * ºº×Ö×ª»»È«Æ´
 * ºº×Ö×ª»»¼òÆ´
 * ºº×Ö×ª»»Ê××ÖÄ¸
 */
    public class PinYin
    {
        #region ÊôĞÔÊı¾İ¶¨Òå
        # region Ò»¼¶ºº×Ö
        /// <summary>
        /// ºº×ÖµÄ»úÄÚÂëÊı×é
        /// </summary>
        private static int[] pyValue = new int[]
        {
            -20319,-20317,-20304,-20295,-20292,-20283,-20265,-20257,-20242,-20230,-20051,-20036,
            -20032,-20026,-20002,-19990,-19986,-19982,-19976,-19805,-19784,-19775,-19774,-19763,
            -19756,-19751,-19746,-19741,-19739,-19728,-19725,-19715,-19540,-19531,-19525,-19515,
            -19500,-19484,-19479,-19467,-19289,-19288,-19281,-19275,-19270,-19263,-19261,-19249,
            -19243,-19242,-19238,-19235,-19227,-19224,-19218,-19212,-19038,-19023,-19018,-19006,
            -19003,-18996,-18977,-18961,-18952,-18783,-18774,-18773,-18763,-18756,-18741,-18735,
            -18731,-18722,-18710,-18697,-18696,-18526,-18518,-18501,-18490,-18478,-18463,-18448,
            -18447,-18446,-18239,-18237,-18231,-18220,-18211,-18201,-18184,-18183, -18181,-18012,
            -17997,-17988,-17970,-17964,-17961,-17950,-17947,-17931,-17928,-17922,-17759,-17752,
            -17733,-17730,-17721,-17703,-17701,-17697,-17692,-17683,-17676,-17496,-17487,-17482,
            -17468,-17454,-17433,-17427,-17417,-17202,-17185,-16983,-16970,-16942,-16915,-16733,
            -16708,-16706,-16689,-16664,-16657,-16647,-16474,-16470,-16465,-16459,-16452,-16448,
            -16433,-16429,-16427,-16423,-16419,-16412,-16407,-16403,-16401,-16393,-16220,-16216,
            -16212,-16205,-16202,-16187,-16180,-16171,-16169,-16158,-16155,-15959,-15958,-15944,
            -15933,-15920,-15915,-15903,-15889,-15878,-15707,-15701,-15681,-15667,-15661,-15659,
            -15652,-15640,-15631,-15625,-15454,-15448,-15436,-15435,-15419,-15416,-15408,-15394,
            -15385,-15377,-15375,-15369,-15363,-15362,-15183,-15180,-15165,-15158,-15153,-15150,
            -15149,-15144,-15143,-15141,-15140,-15139,-15128,-15121,-15119,-15117,-15110,-15109,
            -14941,-14937,-14933,-14930,-14929,-14928,-14926,-14922,-14921,-14914,-14908,-14902,
            -14894,-14889,-14882,-14873,-14871,-14857,-14678,-14674,-14670,-14668,-14663,-14654,
            -14645,-14630,-14594,-14429,-14407,-14399,-14384,-14379,-14368,-14355,-14353,-14345,
            -14170,-14159,-14151,-14149,-14145,-14140,-14137,-14135,-14125,-14123,-14122,-14112,
            -14109,-14099,-14097,-14094,-14092,-14090,-14087,-14083,-13917,-13914,-13910,-13907,
            -13906,-13905,-13896,-13894,-13878,-13870,-13859,-13847,-13831,-13658,-13611,-13601,
            -13406,-13404,-13400,-13398,-13395,-13391,-13387,-13383,-13367,-13359,-13356,-13343,
            -13340,-13329,-13326,-13318,-13147,-13138,-13120,-13107,-13096,-13095,-13091,-13076,
            -13068,-13063,-13060,-12888,-12875,-12871,-12860,-12858,-12852,-12849,-12838,-12831,
            -12829,-12812,-12802,-12607,-12597,-12594,-12585,-12556,-12359,-12346,-12320,-12300,
            -12120,-12099,-12089,-12074,-12067,-12058,-12039,-11867,-11861,-11847,-11831,-11798,
            -11781,-11604,-11589,-11536,-11358,-11340,-11339,-11324,-11303,-11097,-11077,-11067,
            -11055,-11052,-11045,-11041,-11038,-11024,-11020,-11019,-11018,-11014,-10838,-10832,
            -10815,-10800,-10790,-10780,-10764,-10587,-10544,-10533,-10519,-10331,-10329,-10328,
            -10322,-10315,-10309,-10307,-10296,-10281,-10274,-10270,-10262,-10260,-10256,-10254
        };
        /// <summary>
        /// »úÄÚÂë¶ÔÓ¦µÄÆ´ÒôÊı×é
        /// </summary>
        private static string[] pyName = new string[]
        {
            "a","ai","an","ang","ao","ba","bai","ban","bang","bao","bei","ben",
            "beng","bi","bian","biao","bie","bin","bing","bo","bu","ba","cai","can",
            "cang","cao","ce","ceng","cha","chai","chan","chang","chao","che","chen","cheng",
            "chi","chong","chou","chu","chuai","chuan","chuang","chui","chun","chuo","ci","cong",
            "cou","cu","cuan","cui","cun","cuo","da","dai","dan","dang","dao","de",
            "deng","di","dian","diao","die","ding","diu","dong","dou","du","duan","dui",
            "dun","duo","e","en","er","fa","fan","fang","fei","fen","feng","fo",
            "fou","fu","ga","gai","gan","gang","gao","ge","gei","gen","geng","gong",
            "gou","gu","gua","guai","guan","guang","gui","gun","guo","ha","hai","han",
            "hang","hao","he","hei","hen","heng","hong","hou","hu","hua","huai","huan",
            "huang","hui","hun","huo","ji","jia","jian","jiang","jiao","jie","jin","jing",
            "jiong","jiu","ju","juan","jue","jun","ka","kai","kan","kang","kao","ke",
            "ken","keng","kong","kou","ku","kua","kuai","kuan","kuang","kui","kun","kuo",
            "la","lai","lan","lang","lao","le","lei","leng","li","lia","lian","liang",
            "liao","lie","lin","ling","liu","long","lou","lu","lv","luan","lue","lun",
            "luo","ma","mai","man","mang","mao","me","mei","men","meng","mi","mian",
            "miao","mie","min","ming","miu","mo","mou","mu","na","nai","nan","nang",
            "nao","ne","nei","nen","neng","ni","nian","niang","niao","nie","nin","ning",
            "niu","nong","nu","nv","nuan","nue","nuo","o","ou","pa","pai","pan",
            "pang","pao","pei","pen","peng","pi","pian","piao","pie","pin","ping","po",
            "pu","qi","qia","qian","qiang","qiao","qie","qin","qing","qiong","qiu","qu",
            "quan","que","qun","ran","rang","rao","re","ren","reng","ri","rong","rou",
            "ru","ruan","rui","run","ruo","sa","sai","san","sang","sao","se","sen",
            "seng","sha","shai","shan","shang","shao","she","shen","sheng","shi","shou","shu",
            "shua","shuai","shuan","shuang","shui","shun","shuo","si","song","sou","su","suan",
            "sui","sun","suo","ta","tai","tan","tang","tao","te","teng","ti","tian",
            "tiao","tie","ting","tong","tou","tu","tuan","tui","tun","tuo","wa","wai",
            "wan","wang","wei","wen","weng","wo","wu","xi","xia","xian","xiang","xiao",
            "xie","xin","xing","xiong","xiu","xu","xuan","xue","xun","ya","yan","yang",
            "yao","ye","yi","yin","ying","yo","yong","you","yu","yuan","yue","yun",
            "za", "zai","zan","zang","zao","ze","zei","zen","zeng","zha","zhai","zhan",
            "zhang","zhao","zhe","zhen","zheng","zhi","zhong","zhou","zhu","zhua","zhuai","zhuan",
            "zhuang","zhui","zhun","zhuo","zi","zong","zou","zu","zuan","zui","zun","zuo"
        };
        #endregion

        #region ¶ş¼¶ºº×Ö
        /// <summary>
        /// ¶ş¼¶ºº×ÖÊı×é
        /// </summary>
        private static string[] otherChinese = new string[]
        {
            "Ø¡","Ø¢","Ø£","Ø¤","Ø¥","Ø¦","Ø§","Ø¨","Ø©","Øª","Ø«","Ø¬","Ø­","Ø®","Ø¯"
            ,"Ø°","Ø±","Ø²","Ø³","Ø´","Øµ","Ø¶","Ø·","Ø¸","Ø¹","Øº","Ø»","Ø¼","Ø½","Ø¾","Ø¿"
            ,"ØÀ","ØÁ","ØÂ","ØÃ","ØÄ","ØÅ","ØÆ","ØÇ","ØÈ","ØÉ","ØÊ","ØË","ØÌ","ØÍ","ØÎ","ØÏ"
            ,"ØĞ","ØÑ","ØÒ","ØÓ","ØÔ","ØÕ","ØÖ","Ø×","ØØ","ØÙ","ØÚ","ØÛ","ØÜ","Øİ","ØŞ","Øß"
            ,"Øà","Øá","Øâ","Øã","Øä","Øå","Øæ","Øç","Øè","Øé","Øê","Øë","Øì","Øí","Øî","Øï"
            ,"Øğ","Øñ","Øò","Øó","Øô","Øõ","Øö","Ø÷","Øø","Øù","Øú","Øû","Øü","Øı","Øş"
            ,"Ù¡","Ù¢","Ù£","Ù¤","Ù¥","Ù¦","Ù§","Ù¨","Ù©","Ùª","Ù«","Ù¬","Ù­","Ù®","Ù¯"
            ,"Ù°","Ù±","Ù²","Ù³","Ù´","Ùµ","Ù¶","Ù·","Ù¸","Ù¹","Ùº","Ù»","Ù¼","Ù½","Ù¾","Ù¿"
            ,"ÙÀ","ÙÁ","ÙÂ","ÙÃ","ÙÄ","ÙÅ","ÙÆ","ÙÇ","ÙÈ","ÙÉ","ÙÊ","ÙË","ÙÌ","ÙÍ","ÙÎ","ÙÏ"
            ,"ÙĞ","ÙÑ","ÙÒ","ÙÓ","ÙÔ","ÙÕ","ÙÖ","Ù×","ÙØ","ÙÙ","ÙÚ","ÙÛ","ÙÜ","Ùİ","ÙŞ","Ùß"
            ,"Ùà","Ùá","Ùâ","Ùã","Ùä","Ùå","Ùæ","Ùç","Ùè","Ùé","Ùê","Ùë","Ùì","Ùí","Ùî","Ùï"
            ,"Ùğ","Ùñ","Ùò","Ùó","Ùô","Ùõ","Ùö","Ù÷","Ùø","Ùù","Ùú","Ùû","Ùü","Ùı","Ùş"
            ,"Ú¡","Ú¢","Ú£","Ú¤","Ú¥","Ú¦","Ú§","Ú¨","Ú©","Úª","Ú«","Ú¬","Ú­","Ú®","Ú¯"
            ,"Ú°","Ú±","Ú²","Ú³","Ú´","Úµ","Ú¶","Ú·","Ú¸","Ú¹","Úº","Ú»","Ú¼","Ú½","Ú¾","Ú¿"
            ,"ÚÀ","ÚÁ","ÚÂ","ÚÃ","ÚÄ","ÚÅ","ÚÆ","ÚÇ","ÚÈ","ÚÉ","ÚÊ","ÚË","ÚÌ","ÚÍ","ÚÎ","ÚÏ"
            ,"ÚĞ","ÚÑ","ÚÒ","ÚÓ","ÚÔ","ÚÕ","ÚÖ","Ú×","ÚØ","ÚÙ","ÚÚ","ÚÛ","ÚÜ","Úİ","ÚŞ","Úß"
            ,"Úà","Úá","Úâ","Úã","Úä","Úå","Úæ","Úç","Úè","Úé","Úê","Úë","Úì","Úí","Úî","Úï"
            ,"Úğ","Úñ","Úò","Úó","Úô","Úõ","Úö","Ú÷","Úø","Úù","Úú","Úû","Úü","Úı","Úş"
            ,"Û¡","Û¢","Û£","Û¤","Û¥","Û¦","Û§","Û¨","Û©","Ûª","Û«","Û¬","Û­","Û®","Û¯"
            ,"Û°","Û±","Û²","Û³","Û´","Ûµ","Û¶","Û·","Û¸","Û¹","Ûº","Û»","Û¼","Û½","Û¾","Û¿"
            ,"ÛÀ","ÛÁ","ÛÂ","ÛÃ","ÛÄ","ÛÅ","ÛÆ","ÛÇ","ÛÈ","ÛÉ","ÛÊ","ÛË","ÛÌ","ÛÍ","ÛÎ","ÛÏ"
            ,"ÛĞ","ÛÑ","ÛÒ","ÛÓ","ÛÔ","ÛÕ","ÛÖ","Û×","ÛØ","ÛÙ","ÛÚ","ÛÛ","ÛÜ","Ûİ","ÛŞ","Ûß"
            ,"Ûà","Ûá","Ûâ","Ûã","Ûä","Ûå","Ûæ","Ûç","Ûè","Ûé","Ûê","Ûë","Ûì","Ûí","Ûî","Ûï"
            ,"Ûğ","Ûñ","Ûò","Ûó","Ûô","Ûõ","Ûö","Û÷","Ûø","Ûù","Ûú","Ûû","Ûü","Ûı","Ûş"
            ,"Ü¡","Ü¢","Ü£","Ü¤","Ü¥","Ü¦","Ü§","Ü¨","Ü©","Üª","Ü«","Ü¬","Ü­","Ü®","Ü¯"
            ,"Ü°","Ü±","Ü²","Ü³","Ü´","Üµ","Ü¶","Ü·","Ü¸","Ü¹","Üº","Ü»","Ü¼","Ü½","Ü¾","Ü¿"
            ,"ÜÀ","ÜÁ","ÜÂ","ÜÃ","ÜÄ","ÜÅ","ÜÆ","ÜÇ","ÜÈ","ÜÉ","ÜÊ","ÜË","ÜÌ","ÜÍ","ÜÎ","ÜÏ"
            ,"ÜĞ","ÜÑ","ÜÒ","ÜÓ","ÜÔ","ÜÕ","ÜÖ","Ü×","ÜØ","ÜÙ","ÜÚ","ÜÛ","ÜÜ","Üİ","ÜŞ","Üß"
            ,"Üà","Üá","Üâ","Üã","Üä","Üå","Üæ","Üç","Üè","Üé","Üê","Üë","Üì","Üí","Üî","Üï"
            ,"Üğ","Üñ","Üò","Üó","Üô","Üõ","Üö","Ü÷","Üø","Üù","Üú","Üû","Üü","Üı","Üş"
            ,"İ¡","İ¢","İ£","İ¤","İ¥","İ¦","İ§","İ¨","İ©","İª","İ«","İ¬","İ­","İ®","İ¯"
            ,"İ°","İ±","İ²","İ³","İ´","İµ","İ¶","İ·","İ¸","İ¹","İº","İ»","İ¼","İ½","İ¾","İ¿"
            ,"İÀ","İÁ","İÂ","İÃ","İÄ","İÅ","İÆ","İÇ","İÈ","İÉ","İÊ","İË","İÌ","İÍ","İÎ","İÏ"
            ,"İĞ","İÑ","İÒ","İÓ","İÔ","İÕ","İÖ","İ×","İØ","İÙ","İÚ","İÛ","İÜ","İİ","İŞ","İß"
            ,"İà","İá","İâ","İã","İä","İå","İæ","İç","İè","İé","İê","İë","İì","İí","İî","İï"
            ,"İğ","İñ","İò","İó","İô","İõ","İö","İ÷","İø","İù","İú","İû","İü","İı","İş"
            ,"Ş¡","Ş¢","Ş£","Ş¤","Ş¥","Ş¦","Ş§","Ş¨","Ş©","Şª","Ş«","Ş¬","Ş­","Ş®","Ş¯"
            ,"Ş°","Ş±","Ş²","Ş³","Ş´","Şµ","Ş¶","Ş·","Ş¸","Ş¹","Şº","Ş»","Ş¼","Ş½","Ş¾","Ş¿"
            ,"ŞÀ","ŞÁ","ŞÂ","ŞÃ","ŞÄ","ŞÅ","ŞÆ","ŞÇ","ŞÈ","ŞÉ","ŞÊ","ŞË","ŞÌ","ŞÍ","ŞÎ","ŞÏ"
            ,"ŞĞ","ŞÑ","ŞÒ","ŞÓ","ŞÔ","ŞÕ","ŞÖ","Ş×","ŞØ","ŞÙ","ŞÚ","ŞÛ","ŞÜ","Şİ","ŞŞ","Şß"
            ,"Şà","Şá","Şâ","Şã","Şä","Şå","Şæ","Şç","Şè","Şé","Şê","Şë","Şì","Şí","Şî","Şï"
            ,"Şğ","Şñ","Şò","Şó","Şô","Şõ","Şö","Ş÷","Şø","Şù","Şú","Şû","Şü","Şı","Şş"
            ,"ß¡","ß¢","ß£","ß¤","ß¥","ß¦","ß§","ß¨","ß©","ßª","ß«","ß¬","ß­","ß®","ß¯"
            ,"ß°","ß±","ß²","ß³","ß´","ßµ","ß¶","ß·","ß¸","ß¹","ßº","ß»","ß¼","ß½","ß¾","ß¿"
            ,"ßÀ","ßÁ","ßÂ","ßÃ","ßÄ","ßÅ","ßÆ","ßÇ","ßÈ","ßÉ","ßÊ","ßË","ßÌ","ßÍ","ßÎ","ßÏ"
            ,"ßĞ","ßÑ","ßÒ","ßÓ","ßÔ","ßÕ","ßÖ","ß×","ßØ","ßÙ","ßÚ","ßÛ","ßÜ","ßİ","ßŞ","ßß"
            ,"ßà","ßá","ßâ","ßã","ßä","ßå","ßæ","ßç","ßè","ßé","ßê","ßë","ßì","ßí","ßî","ßï"
            ,"ßğ","ßñ","ßò","ßó","ßô","ßõ","ßö","ß÷","ßø","ßù","ßú","ßû","ßü","ßı","ßş"
            ,"à¡","à¢","à£","à¤","à¥","à¦","à§","à¨","à©","àª","à«","à¬","à­","à®","à¯"
            ,"à°","à±","à²","à³","à´","àµ","à¶","à·","à¸","à¹","àº","à»","à¼","à½","à¾","à¿"
            ,"àÀ","àÁ","àÂ","àÃ","àÄ","àÅ","àÆ","àÇ","àÈ","àÉ","àÊ","àË","àÌ","àÍ","àÎ","àÏ"
            ,"àĞ","àÑ","àÒ","àÓ","àÔ","àÕ","àÖ","à×","àØ","àÙ","àÚ","àÛ","àÜ","àİ","àŞ","àß"
            ,"àà","àá","àâ","àã","àä","àå","àæ","àç","àè","àé","àê","àë","àì","àí","àî","àï"
            ,"àğ","àñ","àò","àó","àô","àõ","àö","à÷","àø","àù","àú","àû","àü","àı","àş"
            ,"á¡","á¢","á£","á¤","á¥","á¦","á§","á¨","á©","áª","á«","á¬","á­","á®","á¯"
            ,"á°","á±","á²","á³","á´","áµ","á¶","á·","á¸","á¹","áº","á»","á¼","á½","á¾","á¿"
            ,"áÀ","áÁ","áÂ","áÃ","áÄ","áÅ","áÆ","áÇ","áÈ","áÉ","áÊ","áË","áÌ","áÍ","áÎ","áÏ"
            ,"áĞ","áÑ","áÒ","áÓ","áÔ","áÕ","áÖ","á×","áØ","áÙ","áÚ","áÛ","áÜ","áİ","áŞ","áß"
            ,"áà","áá","áâ","áã","áä","áå","áæ","áç","áè","áé","áê","áë","áì","áí","áî","áï"
            ,"áğ","áñ","áò","áó","áô","áõ","áö","á÷","áø","áù","áú","áû","áü","áı","áş"
            ,"â¡","â¢","â£","â¤","â¥","â¦","â§","â¨","â©","âª","â«","â¬","â­","â®","â¯"
            ,"â°","â±","â²","â³","â´","âµ","â¶","â·","â¸","â¹","âº","â»","â¼","â½","â¾","â¿"
            ,"âÀ","âÁ","âÂ","âÃ","âÄ","âÅ","âÆ","âÇ","âÈ","âÉ","âÊ","âË","âÌ","âÍ","âÎ","âÏ"
            ,"âĞ","âÑ","âÒ","âÓ","âÔ","âÕ","âÖ","â×","âØ","âÙ","âÚ","âÛ","âÜ","âİ","âŞ","âß"
            ,"âà","âá","ââ","âã","âä","âå","âæ","âç","âè","âé","âê","âë","âì","âí","âî","âï"
            ,"âğ","âñ","âò","âó","âô","âõ","âö","â÷","âø","âù","âú","âû","âü","âı","âş"
            ,"ã¡","ã¢","ã£","ã¤","ã¥","ã¦","ã§","ã¨","ã©","ãª","ã«","ã¬","ã­","ã®","ã¯"
            ,"ã°","ã±","ã²","ã³","ã´","ãµ","ã¶","ã·","ã¸","ã¹","ãº","ã»","ã¼","ã½","ã¾","ã¿"
            ,"ãÀ","ãÁ","ãÂ","ãÃ","ãÄ","ãÅ","ãÆ","ãÇ","ãÈ","ãÉ","ãÊ","ãË","ãÌ","ãÍ","ãÎ","ãÏ"
            ,"ãĞ","ãÑ","ãÒ","ãÓ","ãÔ","ãÕ","ãÖ","ã×","ãØ","ãÙ","ãÚ","ãÛ","ãÜ","ãİ","ãŞ","ãß"
            ,"ãà","ãá","ãâ","ãã","ãä","ãå","ãæ","ãç","ãè","ãé","ãê","ãë","ãì","ãí","ãî","ãï"
            ,"ãğ","ãñ","ãò","ãó","ãô","ãõ","ãö","ã÷","ãø","ãù","ãú","ãû","ãü","ãı","ãş"
            ,"ä¡","ä¢","ä£","ä¤","ä¥","ä¦","ä§","ä¨","ä©","äª","ä«","ä¬","ä­","ä®","ä¯"
            ,"ä°","ä±","ä²","ä³","ä´","äµ","ä¶","ä·","ä¸","ä¹","äº","ä»","ä¼","ä½","ä¾","ä¿"
            ,"äÀ","äÁ","äÂ","äÃ","äÄ","äÅ","äÆ","äÇ","äÈ","äÉ","äÊ","äË","äÌ","äÍ","äÎ","äÏ"
            ,"äĞ","äÑ","äÒ","äÓ","äÔ","äÕ","äÖ","ä×","äØ","äÙ","äÚ","äÛ","äÜ","äİ","äŞ","äß"
            ,"äà","äá","äâ","äã","ää","äå","äæ","äç","äè","äé","äê","äë","äì","äí","äî","äï"
            ,"äğ","äñ","äò","äó","äô","äõ","äö","ä÷","äø","äù","äú","äû","äü","äı","äş"
            ,"å¡","å¢","å£","å¤","å¥","å¦","å§","å¨","å©","åª","å«","å¬","å­","å®","å¯"
            ,"å°","å±","å²","å³","å´","åµ","å¶","å·","å¸","å¹","åº","å»","å¼","å½","å¾","å¿"
            ,"åÀ","åÁ","åÂ","åÃ","åÄ","åÅ","åÆ","åÇ","åÈ","åÉ","åÊ","åË","åÌ","åÍ","åÎ","åÏ"
            ,"åĞ","åÑ","åÒ","åÓ","åÔ","åÕ","åÖ","å×","åØ","åÙ","åÚ","åÛ","åÜ","åİ","åŞ","åß"
            ,"åà","åá","åâ","åã","åä","åå","åæ","åç","åè","åé","åê","åë","åì","åí","åî","åï"
            ,"åğ","åñ","åò","åó","åô","åõ","åö","å÷","åø","åù","åú","åû","åü","åı","åş"
            ,"æ¡","æ¢","æ£","æ¤","æ¥","æ¦","æ§","æ¨","æ©","æª","æ«","æ¬","æ­","æ®","æ¯"
            ,"æ°","æ±","æ²","æ³","æ´","æµ","æ¶","æ·","æ¸","æ¹","æº","æ»","æ¼","æ½","æ¾","æ¿"
            ,"æÀ","æÁ","æÂ","æÃ","æÄ","æÅ","æÆ","æÇ","æÈ","æÉ","æÊ","æË","æÌ","æÍ","æÎ","æÏ"
            ,"æĞ","æÑ","æÒ","æÓ","æÔ","æÕ","æÖ","æ×","æØ","æÙ","æÚ","æÛ","æÜ","æİ","æŞ","æß"
            ,"æà","æá","æâ","æã","æä","æå","ææ","æç","æè","æé","æê","æë","æì","æí","æî","æï"
            ,"æğ","æñ","æò","æó","æô","æõ","æö","æ÷","æø","æù","æú","æû","æü","æı","æş"
            ,"ç¡","ç¢","ç£","ç¤","ç¥","ç¦","ç§","ç¨","ç©","çª","ç«","ç¬","ç­","ç®","ç¯"
            ,"ç°","ç±","ç²","ç³","ç´","çµ","ç¶","ç·","ç¸","ç¹","çº","ç»","ç¼","ç½","ç¾","ç¿"
            ,"çÀ","çÁ","çÂ","çÃ","çÄ","çÅ","çÆ","çÇ","çÈ","çÉ","çÊ","çË","çÌ","çÍ","çÎ","çÏ"
            ,"çĞ","çÑ","çÒ","çÓ","çÔ","çÕ","çÖ","ç×","çØ","çÙ","çÚ","çÛ","çÜ","çİ","çŞ","çß"
            ,"çà","çá","çâ","çã","çä","çå","çæ","çç","çè","çé","çê","çë","çì","çí","çî","çï"
            ,"çğ","çñ","çò","çó","çô","çõ","çö","ç÷","çø","çù","çú","çû","çü","çı","çş"
            ,"è¡","è¢","è£","è¤","è¥","è¦","è§","è¨","è©","èª","è«","è¬","è­","è®","è¯"
            ,"è°","è±","è²","è³","è´","èµ","è¶","è·","è¸","è¹","èº","è»","è¼","è½","è¾","è¿"
            ,"èÀ","èÁ","èÂ","èÃ","èÄ","èÅ","èÆ","èÇ","èÈ","èÉ","èÊ","èË","èÌ","èÍ","èÎ","èÏ"
            ,"èĞ","èÑ","èÒ","èÓ","èÔ","èÕ","èÖ","è×","èØ","èÙ","èÚ","èÛ","èÜ","èİ","èŞ","èß"
            ,"èà","èá","èâ","èã","èä","èå","èæ","èç","èè","èé","èê","èë","èì","èí","èî","èï"
            ,"èğ","èñ","èò","èó","èô","èõ","èö","è÷","èø","èù","èú","èû","èü","èı","èş"
            ,"é¡","é¢","é£","é¤","é¥","é¦","é§","é¨","é©","éª","é«","é¬","é­","é®","é¯"
            ,"é°","é±","é²","é³","é´","éµ","é¶","é·","é¸","é¹","éº","é»","é¼","é½","é¾","é¿"
            ,"éÀ","éÁ","éÂ","éÃ","éÄ","éÅ","éÆ","éÇ","éÈ","éÉ","éÊ","éË","éÌ","éÍ","éÎ","éÏ"
            ,"éĞ","éÑ","éÒ","éÓ","éÔ","éÕ","éÖ","é×","éØ","éÙ","éÚ","éÛ","éÜ","éİ","éŞ","éß"
            ,"éà","éá","éâ","éã","éä","éå","éæ","éç","éè","éé","éê","éë","éì","éí","éî","éï"
            ,"éğ","éñ","éò","éó","éô","éõ","éö","é÷","éø","éù","éú","éû","éü","éı","éş"
            ,"ê¡","ê¢","ê£","ê¤","ê¥","ê¦","ê§","ê¨","ê©","êª","ê«","ê¬","ê­","ê®","ê¯"
            ,"ê°","ê±","ê²","ê³","ê´","êµ","ê¶","ê·","ê¸","ê¹","êº","ê»","ê¼","ê½","ê¾","ê¿"
            ,"êÀ","êÁ","êÂ","êÃ","êÄ","êÅ","êÆ","êÇ","êÈ","êÉ","êÊ","êË","êÌ","êÍ","êÎ","êÏ"
            ,"êĞ","êÑ","êÒ","êÓ","êÔ","êÕ","êÖ","ê×","êØ","êÙ","êÚ","êÛ","êÜ","êİ","êŞ","êß"
            ,"êà","êá","êâ","êã","êä","êå","êæ","êç","êè","êé","êê","êë","êì","êí","êî","êï"
            ,"êğ","êñ","êò","êó","êô","êõ","êö","ê÷","êø","êù","êú","êû","êü","êı","êş"
            ,"ë¡","ë¢","ë£","ë¤","ë¥","ë¦","ë§","ë¨","ë©","ëª","ë«","ë¬","ë­","ë®","ë¯"
            ,"ë°","ë±","ë²","ë³","ë´","ëµ","ë¶","ë·","ë¸","ë¹","ëº","ë»","ë¼","ë½","ë¾","ë¿"
            ,"ëÀ","ëÁ","ëÂ","ëÃ","ëÄ","ëÅ","ëÆ","ëÇ","ëÈ","ëÉ","ëÊ","ëË","ëÌ","ëÍ","ëÎ","ëÏ"
            ,"ëĞ","ëÑ","ëÒ","ëÓ","ëÔ","ëÕ","ëÖ","ë×","ëØ","ëÙ","ëÚ","ëÛ","ëÜ","ëİ","ëŞ","ëß"
            ,"ëà","ëá","ëâ","ëã","ëä","ëå","ëæ","ëç","ëè","ëé","ëê","ëë","ëì","ëí","ëî","ëï"
            ,"ëğ","ëñ","ëò","ëó","ëô","ëõ","ëö","ë÷","ëø","ëù","ëú","ëû","ëü","ëı","ëş"
            ,"ì¡","ì¢","ì£","ì¤","ì¥","ì¦","ì§","ì¨","ì©","ìª","ì«","ì¬","ì­","ì®","ì¯"
            ,"ì°","ì±","ì²","ì³","ì´","ìµ","ì¶","ì·","ì¸","ì¹","ìº","ì»","ì¼","ì½","ì¾","ì¿"
            ,"ìÀ","ìÁ","ìÂ","ìÃ","ìÄ","ìÅ","ìÆ","ìÇ","ìÈ","ìÉ","ìÊ","ìË","ìÌ","ìÍ","ìÎ","ìÏ"
            ,"ìĞ","ìÑ","ìÒ","ìÓ","ìÔ","ìÕ","ìÖ","ì×","ìØ","ìÙ","ìÚ","ìÛ","ìÜ","ìİ","ìŞ","ìß"
            ,"ìà","ìá","ìâ","ìã","ìä","ìå","ìæ","ìç","ìè","ìé","ìê","ìë","ìì","ìí","ìî","ìï"
            ,"ìğ","ìñ","ìò","ìó","ìô","ìõ","ìö","ì÷","ìø","ìù","ìú","ìû","ìü","ìı","ìş"
            ,"í¡","í¢","í£","í¤","í¥","í¦","í§","í¨","í©","íª","í«","í¬","í­","í®","í¯"
            ,"í°","í±","í²","í³","í´","íµ","í¶","í·","í¸","í¹","íº","í»","í¼","í½","í¾","í¿"
            ,"íÀ","íÁ","íÂ","íÃ","íÄ","íÅ","íÆ","íÇ","íÈ","íÉ","íÊ","íË","íÌ","íÍ","íÎ","íÏ"
            ,"íĞ","íÑ","íÒ","íÓ","íÔ","íÕ","íÖ","í×","íØ","íÙ","íÚ","íÛ","íÜ","íİ","íŞ","íß"
            ,"íà","íá","íâ","íã","íä","íå","íæ","íç","íè","íé","íê","íë","íì","íí","íî","íï"
            ,"íğ","íñ","íò","íó","íô","íõ","íö","í÷","íø","íù","íú","íû","íü","íı","íş"
            ,"î¡","î¢","î£","î¤","î¥","î¦","î§","î¨","î©","îª","î«","î¬","î­","î®","î¯"
            ,"î°","î±","î²","î³","î´","îµ","î¶","î·","î¸","î¹","îº","î»","î¼","î½","î¾","î¿"
            ,"îÀ","îÁ","îÂ","îÃ","îÄ","îÅ","îÆ","îÇ","îÈ","îÉ","îÊ","îË","îÌ","îÍ","îÎ","îÏ"
            ,"îĞ","îÑ","îÒ","îÓ","îÔ","îÕ","îÖ","î×","îØ","îÙ","îÚ","îÛ","îÜ","îİ","îŞ","îß"
            ,"îà","îá","îâ","îã","îä","îå","îæ","îç","îè","îé","îê","îë","îì","îí","îî","îï"
            ,"îğ","îñ","îò","îó","îô","îõ","îö","î÷","îø","îù","îú","îû","îü","îı","îş"
            ,"ï¡","ï¢","ï£","ï¤","ï¥","ï¦","ï§","ï¨","ï©","ïª","ï«","ï¬","ï­","ï®","ï¯"
            ,"ï°","ï±","ï²","ï³","ï´","ïµ","ï¶","ï·","ï¸","ï¹","ïº","ï»","ï¼","ï½","ï¾","ï¿"
            ,"ïÀ","ïÁ","ïÂ","ïÃ","ïÄ","ïÅ","ïÆ","ïÇ","ïÈ","ïÉ","ïÊ","ïË","ïÌ","ïÍ","ïÎ","ïÏ"
            ,"ïĞ","ïÑ","ïÒ","ïÓ","ïÔ","ïÕ","ïÖ","ï×","ïØ","ïÙ","ïÚ","ïÛ","ïÜ","ïİ","ïŞ","ïß"
            ,"ïà","ïá","ïâ","ïã","ïä","ïå","ïæ","ïç","ïè","ïé","ïê","ïë","ïì","ïí","ïî","ïï"
            ,"ïğ","ïñ","ïò","ïó","ïô","ïõ","ïö","ï÷","ïø","ïù","ïú","ïû","ïü","ïı","ïş"
            ,"ğ¡","ğ¢","ğ£","ğ¤","ğ¥","ğ¦","ğ§","ğ¨","ğ©","ğª","ğ«","ğ¬","ğ­","ğ®","ğ¯"
            ,"ğ°","ğ±","ğ²","ğ³","ğ´","ğµ","ğ¶","ğ·","ğ¸","ğ¹","ğº","ğ»","ğ¼","ğ½","ğ¾","ğ¿"
            ,"ğÀ","ğÁ","ğÂ","ğÃ","ğÄ","ğÅ","ğÆ","ğÇ","ğÈ","ğÉ","ğÊ","ğË","ğÌ","ğÍ","ğÎ","ğÏ"
            ,"ğĞ","ğÑ","ğÒ","ğÓ","ğÔ","ğÕ","ğÖ","ğ×","ğØ","ğÙ","ğÚ","ğÛ","ğÜ","ğİ","ğŞ","ğß"
            ,"ğà","ğá","ğâ","ğã","ğä","ğå","ğæ","ğç","ğè","ğé","ğê","ğë","ğì","ğí","ğî","ğï"
            ,"ğğ","ğñ","ğò","ğó","ğô","ğõ","ğö","ğ÷","ğø","ğù","ğú","ğû","ğü","ğı","ğş"
            ,"ñ¡","ñ¢","ñ£","ñ¤","ñ¥","ñ¦","ñ§","ñ¨","ñ©","ñª","ñ«","ñ¬","ñ­","ñ®","ñ¯"
            ,"ñ°","ñ±","ñ²","ñ³","ñ´","ñµ","ñ¶","ñ·","ñ¸","ñ¹","ñº","ñ»","ñ¼","ñ½","ñ¾","ñ¿"
            ,"ñÀ","ñÁ","ñÂ","ñÃ","ñÄ","ñÅ","ñÆ","ñÇ","ñÈ","ñÉ","ñÊ","ñË","ñÌ","ñÍ","ñÎ","ñÏ"
            ,"ñĞ","ñÑ","ñÒ","ñÓ","ñÔ","ñÕ","ñÖ","ñ×","ñØ","ñÙ","ñÚ","ñÛ","ñÜ","ñİ","ñŞ","ñß"
            ,"ñà","ñá","ñâ","ñã","ñä","ñå","ñæ","ñç","ñè","ñé","ñê","ñë","ñì","ñí","ñî","ñï"
            ,"ñğ","ññ","ñò","ñó","ñô","ñõ","ñö","ñ÷","ñø","ñù","ñú","ñû","ñü","ñı","ñş"
            ,"ò¡","ò¢","ò£","ò¤","ò¥","ò¦","ò§","ò¨","ò©","òª","ò«","ò¬","ò­","ò®","ò¯"
            ,"ò°","ò±","ò²","ò³","ò´","òµ","ò¶","ò·","ò¸","ò¹","òº","ò»","ò¼","ò½","ò¾","ò¿"
            ,"òÀ","òÁ","òÂ","òÃ","òÄ","òÅ","òÆ","òÇ","òÈ","òÉ","òÊ","òË","òÌ","òÍ","òÎ","òÏ"
            ,"òĞ","òÑ","òÒ","òÓ","òÔ","òÕ","òÖ","ò×","òØ","òÙ","òÚ","òÛ","òÜ","òİ","òŞ","òß"
            ,"òà","òá","òâ","òã","òä","òå","òæ","òç","òè","òé","òê","òë","òì","òí","òî","òï"
            ,"òğ","òñ","òò","òó","òô","òõ","òö","ò÷","òø","òù","òú","òû","òü","òı","òş"
            ,"ó¡","ó¢","ó£","ó¤","ó¥","ó¦","ó§","ó¨","ó©","óª","ó«","ó¬","ó­","ó®","ó¯"
            ,"ó°","ó±","ó²","ó³","ó´","óµ","ó¶","ó·","ó¸","ó¹","óº","ó»","ó¼","ó½","ó¾","ó¿"
            ,"óÀ","óÁ","óÂ","óÃ","óÄ","óÅ","óÆ","óÇ","óÈ","óÉ","óÊ","óË","óÌ","óÍ","óÎ","óÏ"
            ,"óĞ","óÑ","óÒ","óÓ","óÔ","óÕ","óÖ","ó×","óØ","óÙ","óÚ","óÛ","óÜ","óİ","óŞ","óß"
            ,"óà","óá","óâ","óã","óä","óå","óæ","óç","óè","óé","óê","óë","óì","óí","óî","óï"
            ,"óğ","óñ","óò","óó","óô","óõ","óö","ó÷","óø","óù","óú","óû","óü","óı","óş"
            ,"ô¡","ô¢","ô£","ô¤","ô¥","ô¦","ô§","ô¨","ô©","ôª","ô«","ô¬","ô­","ô®","ô¯"
            ,"ô°","ô±","ô²","ô³","ô´","ôµ","ô¶","ô·","ô¸","ô¹","ôº","ô»","ô¼","ô½","ô¾","ô¿"
            ,"ôÀ","ôÁ","ôÂ","ôÃ","ôÄ","ôÅ","ôÆ","ôÇ","ôÈ","ôÉ","ôÊ","ôË","ôÌ","ôÍ","ôÎ","ôÏ"
            ,"ôĞ","ôÑ","ôÒ","ôÓ","ôÔ","ôÕ","ôÖ","ô×","ôØ","ôÙ","ôÚ","ôÛ","ôÜ","ôİ","ôŞ","ôß"
            ,"ôà","ôá","ôâ","ôã","ôä","ôå","ôæ","ôç","ôè","ôé","ôê","ôë","ôì","ôí","ôî","ôï"
            ,"ôğ","ôñ","ôò","ôó","ôô","ôõ","ôö","ô÷","ôø","ôù","ôú","ôû","ôü","ôı","ôş"
            ,"õ¡","õ¢","õ£","õ¤","õ¥","õ¦","õ§","õ¨","õ©","õª","õ«","õ¬","õ­","õ®","õ¯"
            ,"õ°","õ±","õ²","õ³","õ´","õµ","õ¶","õ·","õ¸","õ¹","õº","õ»","õ¼","õ½","õ¾","õ¿"
            ,"õÀ","õÁ","õÂ","õÃ","õÄ","õÅ","õÆ","õÇ","õÈ","õÉ","õÊ","õË","õÌ","õÍ","õÎ","õÏ"
            ,"õĞ","õÑ","õÒ","õÓ","õÔ","õÕ","õÖ","õ×","õØ","õÙ","õÚ","õÛ","õÜ","õİ","õŞ","õß"
            ,"õà","õá","õâ","õã","õä","õå","õæ","õç","õè","õé","õê","õë","õì","õí","õî","õï"
            ,"õğ","õñ","õò","õó","õô","õõ","õö","õ÷","õø","õù","õú","õû","õü","õı","õş"
            ,"ö¡","ö¢","ö£","ö¤","ö¥","ö¦","ö§","ö¨","ö©","öª","ö«","ö¬","ö­","ö®","ö¯"
            ,"ö°","ö±","ö²","ö³","ö´","öµ","ö¶","ö·","ö¸","ö¹","öº","ö»","ö¼","ö½","ö¾","ö¿"
            ,"öÀ","öÁ","öÂ","öÃ","öÄ","öÅ","öÆ","öÇ","öÈ","öÉ","öÊ","öË","öÌ","öÍ","öÎ","öÏ"
            ,"öĞ","öÑ","öÒ","öÓ","öÔ","öÕ","öÖ","ö×","öØ","öÙ","öÚ","öÛ","öÜ","öİ","öŞ","öß"
            ,"öà","öá","öâ","öã","öä","öå","öæ","öç","öè","öé","öê","öë","öì","öí","öî","öï"
            ,"öğ","öñ","öò","öó","öô","öõ","öö","ö÷","öø","öù","öú","öû","öü","öı","öş"
            ,"÷¡","÷¢","÷£","÷¤","÷¥","÷¦","÷§","÷¨","÷©","÷ª","÷«","÷¬","÷­","÷®","÷¯"
            ,"÷°","÷±","÷²","÷³","÷´","÷µ","÷¶","÷·","÷¸","÷¹","÷º","÷»","÷¼","÷½","÷¾","÷¿"
            ,"÷À","÷Á","÷Â","÷Ã","÷Ä","÷Å","÷Æ","÷Ç","÷È","÷É","÷Ê","÷Ë","÷Ì","÷Í","÷Î","÷Ï"
            ,"÷Ğ","÷Ñ","÷Ò","÷Ó","÷Ô","÷Õ","÷Ö","÷×","÷Ø","÷Ù","÷Ú","÷Û","÷Ü","÷İ","÷Ş","÷ß"
            ,"÷à","÷á","÷â","÷ã","÷ä","÷å","÷æ","÷ç","÷è","÷é","÷ê","÷ë","÷ì","÷í","÷î","÷ï"
            ,"÷ğ","÷ñ","÷ò","÷ó","÷ô","÷õ","÷ö","÷÷","÷ø","÷ù","÷ú","÷û","÷ü","÷ı","÷ş"
        };

        /// <summary>
        /// ¶ş¼¶ºº×Ö¶ÔÓ¦Æ´ÒôÊı×é
        /// </summary>
        private static string[] otherPinYin = new string[]
           {
               "chu","ji","wu","gai","nian","sa","pi","gen","cheng","ge","nao","e","shu","yu","pie"
                ,"bi","tuo","yao","yao","zhi","di","xin","yin","kui","yu","gao","tao","dian","ji","nai","nie"
                ,"ji","qi","mi","bei","se","gu","ze","she","cuo","yan","jue","si","ye","yan","fang","po"
                ,"gui","kui","bian","ze","gua","you","ce","yi","wen","jing","ku","gui","kai","la","ji","yan"
                ,"wan","kuai","piao","jue","qiao","huo","yi","tong","wang","dan","ding","zhang","le","sa","yi","mu"
                ,"ren","yu","pi","ya","wa","wu","chang","cang","kang","zhu","ning","ka","you","yi","gou"
                ,"tong","tuo","ni","ga","ji","er","you","kua","kan","zhu","yi","tiao","chai","jiao","nong"
                ,"mou","chou","yan","li","qiu","li","yu","ping","yong","si","feng","qian","ruo","pai","zhuo","shu"
                ,"luo","wo","bi","ti","guan","kong","ju","fen","yan","xie","ji","wei","zong","lou","tang","bin"
                ,"nuo","chi","xi","jing","jian","jiao","jiu","tong","xuan","dan","tong","tun","she","qian","zu","yue"
                ,"cuan","di","xi","xun","hong","guo","chan","kui","bao","pu","hong","fu","fu","su","si","wen"
                ,"yan","bo","gun","mao","xie","luan","pou","bing","ying","luo","lei","liang","hu","lie","xian"
                ,"song","ping","zhong","ming","yan","jie","hong","shan","ou","ju","ne","gu","he","di","zhao"
                ,"qu","dai","kuang","lei","gua","jie","hui","shen","gou","quan","zheng","hun","xu","qiao","gao","kuang"
                ,"ei","zou","zhuo","wei","yu","shen","chan","sui","chen","jian","xue","ye","e","yu","xuan","an"
                ,"di","zi","pian","mo","dang","su","shi","mi","zhe","jian","zen","qiao","jue","yan","zhan","chen"
                ,"dan","jin","zuo","wu","qian","jing","ban","yan","zuo","bei","jing","gai","zhi","nie","zou","chui"
                ,"pi","wei","huang","wei","xi","han","qiong","kuang","mang","wu","fang","bing","pi","bei","ye"
                ,"di","tai","jia","zhi","zhu","kuai","qie","xun","yun","li","ying","gao","xi","fu","pi"
                ,"tan","yan","juan","yan","yin","zhang","po","shan","zou","ling","feng","chu","huan","mai","qu","shao"
                ,"he","ge","meng","xu","xie","sou","xie","jue","jian","qian","dang","chang","si","bian","ben","qiu"
                ,"ben","e","fa","shu","ji","yong","he","wei","wu","ge","zhen","kuang","pi","yi","li","qi"
                ,"ban","gan","long","dian","lu","che","di","tuo","ni","mu","ao","ya","die","dong","kai","shan"
                ,"shang","nao","gai","yin","cheng","shi","guo","xun","lie","yuan","zhi","an","yi","pi","nian"
                ,"peng","tu","sao","dai","ku","die","yin","leng","hou","ge","yuan","man","yong","liang","chi"
                ,"xin","pi","yi","cao","jiao","nai","du","qian","ji","wan","xiong","qi","xiang","fu","yuan","yun"
                ,"fei","ji","li","e","ju","pi","zhi","rui","xian","chang","cong","qin","wu","qian","qi","shan"
                ,"bian","zhu","kou","yi","mo","gan","pie","long","ba","mu","ju","ran","qing","chi","fu","ling"
                ,"niao","yin","mao","ying","qiong","min","tiao","qian","yi","rao","bi","zi","ju","tong","hui","zhu"
                ,"ting","qiao","fu","ren","xing","quan","hui","xun","ming","qi","jiao","chong","jiang","luo","ying"
                ,"qian","gen","jin","mai","sun","hong","zhou","kan","bi","shi","wo","you","e","mei","you"
                ,"li","tu","xian","fu","sui","you","di","shen","guan","lang","ying","chun","jing","qi","xi","song"
                ,"jin","nai","qi","ba","shu","chang","tie","yu","huan","bi","fu","tu","dan","cui","yan","zu"
                ,"dang","jian","wan","ying","gu","han","qia","feng","shen","xiang","wei","chan","kai","qi","kui","xi"
                ,"e","bao","pa","ting","lou","pai","xuan","jia","zhen","shi","ru","mo","en","bei","weng","hao"
                ,"ji","li","bang","jian","shuo","lang","ying","yu","su","meng","dou","xi","lian","cu","lin"
                ,"qu","kou","xu","liao","hui","xun","jue","rui","zui","ji","meng","fan","qi","hong","xie"
                ,"hong","wei","yi","weng","sou","bi","hao","tai","ru","xun","xian","gao","li","huo","qu","heng"
                ,"fan","nie","mi","gong","yi","kuang","lian","da","yi","xi","zang","pao","you","liao","ga","gan"
                ,"ti","men","tuan","chen","fu","pin","niu","jie","jiao","za","yi","lv","jun","tian","ye","ai"
                ,"na","ji","guo","bai","ju","pou","lie","qian","guan","die","zha","ya","qin","yu","an","xuan"
                ,"bing","kui","yuan","shu","en","chuai","jian","shuo","zhan","nuo","sang","luo","ying","zhi","han"
                ,"zhe","xie","lu","zun","cuan","gan","huan","pi","xing","zhuo","huo","zuan","nang","yi","te"
                ,"dai","shi","bu","chi","ji","kou","dao","le","zha","a","yao","fu","mu","yi","tai","li"
                ,"e","bi","bei","guo","qin","yin","za","ka","ga","gua","ling","dong","ning","duo","nao","you"
                ,"si","kuang","ji","shen","hui","da","lie","yi","xiao","bi","ci","guang","yue","xiu","yi","pai"
                ,"kuai","duo","ji","mie","mi","zha","nong","gen","mou","mai","chi","lao","geng","en","zha","suo"
                ,"zao","xi","zuo","ji","feng","ze","nuo","miao","lin","zhuan","zhou","tao","hu","cui","sha"
                ,"yo","dan","bo","ding","lang","li","shua","chuo","die","da","nan","li","kui","jie","yong"
                ,"kui","jiu","sou","yin","chi","jie","lou","ku","wo","hui","qin","ao","su","du","ke","nie"
                ,"he","chen","suo","ge","a","en","hao","dia","ai","ai","suo","hei","tong","chi","pei","lei"
                ,"cao","piao","qi","ying","beng","sou","di","mi","peng","jue","liao","pu","chuai","jiao","o","qin"
                ,"lu","ceng","deng","hao","jin","jue","yi","sai","pi","ru","cha","huo","nang","wei","jian","nan"
                ,"lun","hu","ling","you","yu","qing","yu","huan","wei","zhi","pei","tang","dao","ze","guo"
                ,"wei","wo","man","zhang","fu","fan","ji","qi","qian","qi","qu","ya","xian","ao","cen"
                ,"lan","ba","hu","ke","dong","jia","xiu","dai","gou","mao","min","yi","dong","qiao","xun","zheng"
                ,"lao","lai","song","yan","gu","xiao","guo","kong","jue","rong","yao","wai","zai","wei","yu","cuo"
                ,"lou","zi","mei","sheng","song","ji","zhang","lin","deng","bin","yi","dian","chi","pang","cu","xun"
                ,"yang","hou","lai","xi","chang","huang","yao","zheng","jiao","qu","san","fan","qiu","an","guang","ma"
                ,"niu","yun","xia","pao","fei","rong","kuai","shou","sun","bi","juan","li","yu","xian","yin"
                ,"suan","yi","guo","luo","ni","she","cu","mi","hu","cha","wei","wei","mei","nao","zhang"
                ,"jing","jue","liao","xie","xun","huan","chuan","huo","sun","yin","dong","shi","tang","tun","xi","ren"
                ,"yu","chi","yi","xiang","bo","yu","hun","zha","sou","mo","xiu","jin","san","zhuan","nang","pi"
                ,"wu","gui","pao","xiu","xiang","tuo","an","yu","bi","geng","ao","jin","chan","xie","lin","ying"
                ,"shu","dao","cun","chan","wu","zhi","ou","chong","wu","kai","chang","chuang","song","bian","niu","hu"
                ,"chu","peng","da","yang","zuo","ni","fu","chao","yi","yi","tong","yan","ce","kai","xun"
                ,"ke","yun","bei","song","qian","kui","kun","yi","ti","quan","qie","xing","fei","chang","wang"
                ,"chou","hu","cui","yun","kui","e","leng","zhui","qiao","bi","su","qie","yong","jing","qiao","chong"
                ,"chu","lin","meng","tian","hui","shuan","yan","wei","hong","min","kang","ta","lv","kun","jiu","lang"
                ,"yu","chang","xi","wen","hun","e","qu","que","he","tian","que","kan","jiang","pan","qiang","san"
                ,"qi","si","cha","feng","yuan","mu","mian","dun","mi","gu","bian","wen","hang","wei","le","gan"
                ,"shu","long","lu","yang","si","duo","ling","mao","luo","xuan","pan","duo","hong","min","jing"
                ,"huan","wei","lie","jia","zhen","yin","hui","zhu","ji","xu","hui","tao","xun","jiang","liu"
                ,"hu","xun","ru","su","wu","lai","wei","zhuo","juan","cen","bang","xi","mei","huan","zhu","qi"
                ,"xi","song","du","zhuo","pei","mian","gan","fei","cong","shen","guan","lu","shuan","xie","yan","mian"
                ,"qiu","sou","huang","xu","pen","jian","xuan","wo","mei","yan","qin","ke","she","mang","ying","pu"
                ,"li","ru","ta","hun","bi","xiu","fu","tang","pang","ming","huang","ying","xiao","lan","cao","hu"
                ,"luo","huan","lian","zhu","yi","lu","xuan","gan","shu","si","shan","shao","tong","chan","lai"
                ,"sui","li","dan","chan","lian","ru","pu","bi","hao","zhuo","han","xie","ying","yue","fen"
                ,"hao","ba","bao","gui","dang","mi","you","chen","ning","jian","qian","wu","liao","qian","huan","jian"
                ,"jian","zou","ya","wu","jiong","ze","yi","er","jia","jing","dai","hou","pang","bu","li","qiu"
                ,"xiao","ti","qun","kui","wei","huan","lu","chuan","huang","qiu","xia","ao","gou","ta","liu","xian"
                ,"lin","ju","xie","miao","sui","la","ji","hui","tuan","zhi","kao","zhi","ji","e","chan","xi"
                ,"ju","chan","jing","nu","mi","fu","bi","yu","che","shuo","fei","yan","wu","yu","bi"
                ,"jin","zi","gui","niu","yu","si","da","zhou","shan","qie","ya","rao","shu","luan","jiao"
                ,"pin","cha","li","ping","wa","xian","suo","di","wei","e","jing","biao","jie","chang","bi","chan"
                ,"nu","ao","yuan","ting","wu","gou","mo","pi","ai","pin","chi","li","yan","qiang","piao","chang"
                ,"lei","zhang","xi","shan","bi","niao","mo","shuang","ga","ga","fu","nu","zi","jie","jue","bao"
                ,"zang","si","fu","zou","yi","nu","dai","xiao","hua","pian","li","qi","ke","zhui","can","zhi"
                ,"wu","ao","liu","shan","biao","cong","chan","ji","xiang","jiao","yu","zhou","ge","wan","kuang"
                ,"yun","pi","shu","gan","xie","fu","zhou","fu","chu","dai","ku","hang","jiang","geng","xiao"
                ,"ti","ling","qi","fei","shang","gun","duo","shou","liu","quan","wan","zi","ke","xiang","ti","miao"
                ,"hui","si","bian","gou","zhui","min","jin","zhen","ru","gao","li","yi","jian","bin","piao","man"
                ,"lei","miao","sao","xie","liao","zeng","jiang","qian","qiao","huan","zuan","yao","ji","chuan","zai","yong"
                ,"ding","ji","wei","bin","min","jue","ke","long","dian","dai","po","min","jia","er","gong","xu"
                ,"ya","heng","yao","luo","xi","hui","lian","qi","ying","qi","hu","kun","yan","cong","wan"
                ,"chen","ju","mao","yu","yuan","xia","nao","ai","tang","jin","huang","ying","cui","cong","xuan"
                ,"zhang","pu","can","qu","lu","bi","zan","wen","wei","yun","tao","wu","shao","qi","cha","ma"
                ,"li","pi","miao","yao","rui","jian","chu","cheng","cong","xiao","fang","pa","zhu","nai","zhi","zhe"
                ,"long","jiu","ping","lu","xia","xiao","you","zhi","tuo","zhi","ling","gou","di","li","tuo","cheng"
                ,"kao","lao","ya","rao","zhi","zhen","guang","qi","ting","gua","jiu","hua","heng","gui","jie","luan"
                ,"juan","an","xu","fan","gu","fu","jue","zi","suo","ling","chu","fen","du","qian","zhao"
                ,"luo","chui","liang","guo","jian","di","ju","cou","zhen","nan","zha","lian","lan","ji","pin"
                ,"ju","qiu","duan","chui","chen","lv","cha","ju","xuan","mei","ying","zhen","fei","ta","sun","xie"
                ,"gao","cui","gao","shuo","bin","rong","zhu","xie","jin","qiang","qi","chu","tang","zhu","hu","gan"
                ,"yue","qing","tuo","jue","qiao","qin","lu","zun","xi","ju","yuan","lei","yan","lin","bo","cha"
                ,"you","ao","mo","cu","shang","tian","yun","lian","piao","dan","ji","bin","yi","ren","e","gu"
                ,"ke","lu","zhi","yi","zhen","hu","li","yao","shi","zhi","quan","lu","zhe","nian","wang"
                ,"chuo","zi","cou","lu","lin","wei","jian","qiang","jia","ji","ji","kan","deng","gai","jian"
                ,"zang","ou","ling","bu","beng","zeng","pi","po","ga","la","gan","hao","tan","gao","ze","xin"
                ,"yun","gui","he","zan","mao","yu","chang","ni","qi","sheng","ye","chao","yan","hui","bu","han"
                ,"gui","xuan","kui","ai","ming","tun","xun","yao","xi","nang","ben","shi","kuang","yi","zhi","zi"
                ,"gai","jin","zhen","lai","qiu","ji","dan","fu","chan","ji","xi","di","yu","gou","jin","qu"
                ,"jian","jiang","pin","mao","gu","wu","gu","ji","ju","jian","pian","kao","qie","suo","bai"
                ,"ge","bo","mao","mu","cui","jian","san","shu","chang","lu","pu","qu","pie","dao","xian"
                ,"chuan","dong","ya","yin","ke","yun","fan","chi","jiao","du","die","you","yuan","guo","yue","wo"
                ,"rong","huang","jing","ruan","tai","gong","zhun","na","yao","qian","long","dong","ka","lu","jia","shen"
                ,"zhou","zuo","gua","zhen","qu","zhi","jing","guang","dong","yan","kuai","sa","hai","pian","zhen","mi"
                ,"tun","luo","cuo","pao","wan","niao","jing","yan","fei","yu","zong","ding","jian","cou","nan","mian"
                ,"wa","e","shu","cheng","ying","ge","lv","bin","teng","zhi","chuai","gu","meng","sao","shan"
                ,"lian","lin","yu","xi","qi","sha","xin","xi","biao","sa","ju","sou","biao","biao","shu"
                ,"gou","gu","hu","fei","ji","lan","yu","pei","mao","zhan","jing","ni","liu","yi","yang","wei"
                ,"dun","qiang","shi","hu","zhu","xuan","tai","ye","yang","wu","han","men","chao","yan","hu","yu"
                ,"wei","duan","bao","xuan","bian","tui","liu","man","shang","yun","yi","yu","fan","sui","xian","jue"
                ,"cuan","huo","tao","xu","xi","li","hu","jiong","hu","fei","shi","si","xian","zhi","qu","hu"
                ,"fu","zuo","mi","zhi","ci","zhen","tiao","qi","chan","xi","zhuo","xi","rang","te","tan"
                ,"dui","jia","hui","nv","nin","yang","zi","que","qian","min","te","qi","dui","mao","men"
                ,"gang","yu","yu","ta","xue","miao","ji","gan","dang","hua","che","dun","ya","zhuo","bian","feng"
                ,"fa","ai","li","long","zha","tong","di","la","tuo","fu","xing","mang","xia","qiao","zhai","dong"
                ,"nao","ge","wo","qi","dui","bei","ding","chen","zhou","jie","di","xuan","bian","zhe","gun","sang"
                ,"qing","qu","dun","deng","jiang","ca","meng","bo","kan","zhi","fu","fu","xu","mian","kou","dun"
                ,"miao","dan","sheng","yuan","yi","sui","zi","chi","mou","lai","jian","di","suo","ya","ni"
                ,"sui","pi","rui","sou","kui","mao","ke","ming","piao","cheng","kan","lin","gu","ding","bi"
                ,"quan","tian","fan","zhen","she","wan","tuan","fu","gang","gu","li","yan","pi","lan","li","ji"
                ,"zeng","he","guan","juan","jin","ga","yi","po","zhao","liao","tu","chuan","shan","men","chai","nv"
                ,"bu","tai","ju","ban","qian","fang","kang","dou","huo","ba","yu","zheng","gu","ke","po","bu"
                ,"bo","yue","mu","tan","dian","shuo","shi","xuan","ta","bi","ni","pi","duo","kao","lao","er"
                ,"you","cheng","jia","nao","ye","cheng","diao","yin","kai","zhu","ding","diu","hua","quan","ha"
                ,"sha","diao","zheng","se","chong","tang","an","ru","lao","lai","te","keng","zeng","li","gao"
                ,"e","cuo","lve","liu","kai","jian","lang","qin","ju","a","qiang","nuo","ben","de","ke","kun"
                ,"gu","huo","pei","juan","tan","zi","qie","kai","si","e","cha","sou","huan","ai","lou","qiang"
                ,"fei","mei","mo","ge","juan","na","liu","yi","jia","bin","biao","tang","man","luo","yong","chuo"
                ,"xuan","di","tan","jue","pu","lu","dui","lan","pu","cuan","qiang","deng","huo","zhuo","yi","cha"
                ,"biao","zhong","shen","cuo","zhi","bi","zi","mo","shu","lv","ji","fu","lang","ke","ren"
                ,"zhen","ji","se","nian","fu","rang","gui","jiao","hao","xi","po","die","hu","yong","jiu"
                ,"yuan","bao","zhen","gu","dong","lu","qu","chi","si","er","zhi","gua","xiu","luan","bo","li"
                ,"hu","yu","xian","ti","wu","miao","an","bei","chun","hu","e","ci","mei","wu","yao","jian"
                ,"ying","zhe","liu","liao","jiao","jiu","yu","hu","lu","guan","bing","ding","jie","li","shan","li"
                ,"you","gan","ke","da","zha","pao","zhu","xuan","jia","ya","yi","zhi","lao","wu","cuo","xian"
                ,"sha","zhu","fei","gu","wei","yu","yu","dan","la","yi","hou","chai","lou","jia","sao"
                ,"chi","mo","ban","ji","huang","biao","luo","ying","zhai","long","yin","chou","ban","lai","yi"
                ,"dian","pi","dian","qu","yi","song","xi","qiong","zhun","bian","yao","tiao","dou","ke","yu","xun"
                ,"ju","yu","yi","cha","na","ren","jin","mei","pan","dang","jia","ge","ken","lian","cheng","lian"
                ,"jian","biao","chu","ti","bi","ju","duo","da","bei","bao","lv","bian","lan","chi","zhe","qiang"
                ,"ru","pan","ya","xu","jun","cun","jin","lei","zi","chao","si","huo","lao","tang","ou","lou"
                ,"jiang","nou","mo","die","ding","dan","ling","ning","guo","kui","ao","qin","han","qi","hang"
                ,"jie","he","ying","ke","han","e","zhuan","nie","man","sang","hao","ru","pin","hu","qian"
                ,"qiu","ji","chai","hui","ge","meng","fu","pi","rui","xian","hao","jie","gong","dou","yin","chi"
                ,"han","gu","ke","li","you","ran","zha","qiu","ling","cheng","you","qiong","jia","nao","zhi","si"
                ,"qu","ting","kuo","qi","jiao","yang","mou","shen","zhe","shao","wu","li","chu","fu","qiang","qing"
                ,"qi","xi","yu","fei","guo","guo","yi","pi","tiao","quan","wan","lang","meng","chun","rong","nan"
                ,"fu","kui","ke","fu","sou","yu","you","lou","you","bian","mou","qin","ao","man","mang"
                ,"ma","yuan","xi","chi","tang","pang","shi","huang","cao","piao","tang","xi","xiang","zhong","zhang"
                ,"shuai","mao","peng","hui","pan","shan","huo","meng","chan","lian","mie","li","du","qu","fou","ying"
                ,"qing","xia","shi","zhu","yu","ji","du","ji","jian","zhao","zi","hu","qiong","po","da","sheng"
                ,"ze","gou","li","si","tiao","jia","bian","chi","kou","bi","xian","yan","quan","zheng","jun","shi"
                ,"gang","pa","shao","xiao","qing","ze","qie","zhu","ruo","qian","tuo","bi","dan","kong","wan","xiao"
                ,"zhen","kui","huang","hou","gou","fei","li","bi","chi","su","mie","dou","lu","duan","gui"
                ,"dian","zan","deng","bo","lai","zhou","yu","yu","chong","xi","nie","nv","chuan","shan","yi"
                ,"bi","zhong","ban","fang","ge","lu","zhu","ze","xi","shao","wei","meng","shou","cao","chong","meng"
                ,"qin","niao","jia","qiu","sha","bi","di","qiang","suo","jie","tang","xi","xian","mi","ba","li"
                ,"tiao","xi","zi","can","lin","zong","san","hou","zan","ci","xu","rou","qiu","jiang","gen","ji"
                ,"yi","ling","xi","zhu","fei","jian","pian","he","yi","jiao","zhi","qi","qi","yao","dao","fu"
                ,"qu","jiu","ju","lie","zi","zan","nan","zhe","jiang","chi","ding","gan","zhou","yi","gu"
                ,"zuo","tuo","xian","ming","zhi","yan","shai","cheng","tu","lei","kun","pei","hu","ti","xu"
                ,"hai","tang","lao","bu","jiao","xi","ju","li","xun","shi","cuo","dun","qiong","xue","cu","bie"
                ,"bo","ta","jian","fu","qiang","zhi","fu","shan","li","tuo","jia","bo","tai","kui","qiao","bi"
                ,"xian","xian","ji","jiao","liang","ji","chuo","huai","chi","zhi","dian","bo","zhi","jian","die","chuai"
                ,"zhong","ju","duo","cuo","pian","rou","nie","pan","qi","chu","jue","pu","fan","cu","zhu","lin"
                ,"chan","lie","zuan","xie","zhi","diao","mo","xiu","mo","pi","hu","jue","shang","gu","zi"
                ,"gong","su","zhi","zi","qing","liang","yu","li","wen","ting","ji","pei","fei","sha","yin"
                ,"ai","xian","mai","chen","ju","bao","tiao","zi","yin","yu","chuo","wo","mian","yuan","tuo","zhui"
                ,"sun","jun","ju","luo","qu","chou","qiong","luan","wu","zan","mou","ao","liu","bei","xin","you"
                ,"fang","ba","ping","nian","lu","su","fu","hou","tai","gui","jie","wei","er","ji","jiao","xiang"
                ,"xun","geng","li","lian","jian","shi","tiao","gun","sha","huan","ji","qing","ling","zou","fei","kun"
                ,"chang","gu","ni","nian","diao","shi","zi","fen","die","e","qiu","fu","huang","bian","sao"
                ,"ao","qi","ta","guan","yao","le","biao","xue","man","min","yong","gui","shan","zun","li"
                ,"da","yang","da","qiao","man","jian","ju","rou","gou","bei","jie","tou","ku","gu","di","hou"
                ,"ge","ke","bi","lou","qia","kuan","bin","du","mei","ba","yan","liang","xiao","wang","chi","xiang"
                ,"yan","tie","tao","yong","biao","kun","mao","ran","tiao","ji","zi","xiu","quan","jiu","bin","huan"
                ,"lie","me","hui","mi","ji","jun","zhu","mi","qi","ao","she","lin","dai","chu","you","xia"
                ,"yi","qu","du","li","qing","can","an","fen","you","wu","yan","xi","qiu","han","zha"
           };
        #endregion

        #region ±äÁ¿¶¨Òå
        // GB2312-80 ±ê×¼¹æ·¶ÖĞµÚÒ»¸öºº×ÖµÄ»úÄÚÂë.¼´"°¡"µÄ»úÄÚÂë
        private const int firstChCode = -20319;
        // GB2312-80 ±ê×¼¹æ·¶ÖĞ×îºóÒ»¸öºº×ÖµÄ»úÄÚÂë.¼´"÷ş"µÄ»úÄÚÂë
        private const int lastChCode = -2050;
        // GB2312-80 ±ê×¼¹æ·¶ÖĞ×îºóÒ»¸öÒ»¼¶ºº×ÖµÄ»úÄÚÂë.¼´"×ù"µÄ»úÄÚÂë
        private const int lastOfOneLevelChCode = -10247;
        // ÅäÖÃÖĞÎÄ×Ö·û
        //static Regex regex = new Regex("[/u4e00-/u9fa5]$");
        static Regex regex = new Regex("^[\u4e00-\u9fa5]$");
        /// <summary>
        /// ÓÃ×÷±È½ÏµÄºº×ÖÁĞ.
        /// <remarks>
        /// ÊµÏÖÁ÷³Ì:
        /// 1.ÕâĞ©ºº×ÖÊÇ°´a~zÆ´ÒôÅÅĞò.ÇÒÃ¿¸öºº×Ö¶¼ÊÇÒÔa~zÎªÉùÄ¸·¢ÒôµÄµÚÒ»¸öºº×Ö.¼´Ê×½çÏŞºº×Ö
        /// </remarks>
        /// </summary>
        static string[] referenceChinese = new string[] { "ß¹", "°Ë", "àê", "ßÕ", "åí", "·¢", "ê¸", "îş", "Ø¢", "ßÇ", "À¬", "Âè", "ÄÃ", "àŞ", "Å¿", "Æß", "òÅ", "Øí", "Ëû", "ÍÛ", "Ï¦", "Ñ¾", "ÔÑ" };
        /// <summary>
        /// referenceChineseÊı×éÖĞºº×Ö·¢ÒôµÄÉùÄ¸
        /// </summary>
        static string[] pinYinArray = new string[] { "a", "b", "c", "d", "e", "f", "g", "h", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "w", "x", "y", "z" };

        #endregion
        #endregion
        /// <summary>
        /// ÉèÖÃ»ò»ñÈ¡°üº¬ÁĞÍâ´Ê×é¶ÁÒôµÄ¼ü/Öµ¶ÔµÄ×éºÏ¡£
        /// </summary>
        private static Hashtable _Phrase;
        /// <summary>
        /// ÉèÖÃ»ò»ñÈ¡°üº¬ÁĞÍâ´Ê×é¶ÁÒôµÄ¼ü/Öµ¶ÔµÄ×éºÏ¡£
        /// </summary>
        public static Hashtable Phrase
        {
            get
            {
                if (_Phrase == null)
                {
                    _Phrase = new Hashtable();
                    _Phrase.Add("ÖØÇì", "Chong Qing");
                    _Phrase.Add("ÉîÛÚ", "Shen Zhen");
                    _Phrase.Add("Ê²Ã´", "Shen Me");
                }
                return _Phrase;
            }
            set { _Phrase = value; }
        }
        /// <summary>
        /// ½«Ö¸¶¨ÖĞÎÄ×Ö·û´®×ª»»ÎªÆ´ÒôĞÎÊ½¡£
        /// </summary>
        /// <param name="chs">Òª×ª»»µÄÖĞÎÄ×Ö·û´®¡£</param>
        /// <param name="separator">Á¬½ÓÆ´ÒôÖ®¼äµÄ·Ö¸ô·û¡£</param>
        /// <param name="initialCap">Ö¸¶¨ÊÇ·ñ½«Ê××ÖÄ¸´óĞ´¡£</param>
        /// <returns>°üº¬ÖĞÎÄ×Ö·û´®µÄÆ´ÒôµÄ×Ö·û´®¡£</returns>
        public static string Convert(string chs, string separator, bool initialCap)
        {
            if (string.IsNullOrEmpty(chs) && string.IsNullOrEmpty(separator))
                return String.Empty;
            chs = Phrase.Cast<DictionaryEntry>().Aggregate(chs, (current, de) => current.Replace(de.Key.ToString(), String.Format(" {0} ", de.Value.ToString().Replace(" ", separator))));
            // Console.WriteLine("µÚÒ»½×¶Î:" + DateTime.Now.Ticks.ToString());
            // ´æ·Åºº×Ö(Ë«×Ö½Ú)µÄ×Ö½Ú
            byte[] array = new byte[2];
            StringBuilder pySB = new StringBuilder();
            int chrAsc = 0;
            int i1 = 0;
            int i2 = 0;
            bool b = false;
            char[] noWChar = chs.ToCharArray();
            CultureInfo ci = Thread.CurrentThread.CurrentCulture;
            TextInfo ti = ci.TextInfo;
            for (int j = 0; j < noWChar.Length; j++)
            {
                // ÖĞÎÄ×Ö·û
                if (regex.IsMatch(noWChar[j].ToString()))
                {
                    array = System.Text.Encoding.Default.GetBytes(noWChar[j].ToString(CultureInfo.InvariantCulture));
                    string s = noWChar[j].ToString(CultureInfo.InvariantCulture);
                    if (array.Length == 1)
                    {
                        b = true;
                        pySB.Append(s);
                    }
                    else
                    {
                        if (s == "£¿")
                        {
                            pySB.Append(String.IsNullOrEmpty(pySB.ToString()) || b ? s : separator + s);
                            continue;
                        }
                        i1 = (short)(array[0]);
                        i2 = (short)(array[1]);
                        chrAsc = i1 * 256 + i2 - 65536;
                        // Console.WriteLine("Òª²éÕÒµÄºº×ÖµÄ»úÄÚÂëÊÇ: " + chrAsc.ToString() );
                        // ÅĞ¶ÏÊÇ·ñ³¬¹ıGB2312-80±ê×¼ÖĞµÄºº×Ö·¶Î§
                        if (chrAsc > lastChCode || chrAsc < firstChCode)
                        {
                            pySB.Append(noWChar[j]);
                        }
                        // Èç¹ûÊÇÔÚÒ»¼¶ºº×ÖÖĞ
                        else if (chrAsc <= lastOfOneLevelChCode)
                        {
                            // ½«Ò»¼¶ºº×Ö·ÖÎª12¿é,Ã¿¿é33¸öºº×Ö.
                            for (int aPos = 11; aPos >= 0; aPos--)
                            {
                                int aboutPos = aPos * 33;
                                // ´Ó×îºóµÄ¿é¿ªÊ¼É¨Ãè,Èç¹û»úÄÚÂë´óÓÚ¿éµÄµÚÒ»¸ö»úÄÚÂë,ËµÃ÷ÔÚ´Ë¿éÖĞ
                                if (chrAsc >= pyValue[aboutPos])
                                {
                                    // Console.WriteLine("´æÔÚÓÚµÚ " + aPos.ToString() + " ¿é,´Ë¿éµÄµÚÒ»¸ö»úÄÚÂëÊÇ: " + pyValue[aPos * 33].ToString());
                                    // ±éÀú¿éÖĞµÄÃ¿¸öÒô½Ú»úÄÚÂë,´Ó×îºóµÄÒô½Ú»úÄÚÂë¿ªÊ¼É¨Ãè,
                                    // Èç¹ûÒô½ÚÄÚÂëĞ¡ÓÚ»úÄÚÂë,ÔòÈ¡´ËÒô½Ú
                                    for (int i = aboutPos + 32; i >= aboutPos; i--)
                                    {
                                        if (pyValue[i] <= chrAsc)
                                        {
                                            // Console.WriteLine("ÕÒµ½µÚÒ»¸öĞ¡ÓÚÒª²éÕÒ»úÄÚÂëµÄ»úÄÚÂë: " + pyValue[i].ToString());
                                            s = pyName[i];
                                            if (initialCap)
                                                s = ti.ToTitleCase(s);
                                            //pySB.Append(pyName[i].Substring(0, 1).ToUpper() + pyName[i].Substring(1));
                                            pySB.Append(String.IsNullOrEmpty(pySB.ToString()) || b ? s : separator + s);
                                            break;
                                        }
                                    }
                                    break;
                                }
                            }
                            // Console.WriteLine("µÚËÄ½×¶Î:" + DateTime.Now.Ticks.ToString());
                        }
                        // Èç¹ûÊÇÔÚ¶ş¼¶ºº×ÖÖĞ
                        else
                        {
                            //Console.WriteLine("µÚÎå½×¶Î:" + DateTime.Now.Ticks.ToString());
                            int pos = Array.IndexOf(otherChinese, noWChar[j].ToString());
                            if (pos != decimal.MinusOne)
                            {
                                //pySB.Append(otherPinYin[pos].Substring(0, 1).ToUpper() + otherPinYin[pos].Substring(1));
                                s = otherPinYin[pos];
                                if (initialCap)
                                    s = ti.ToTitleCase(s);
                                //pySB.Append(pyName[i].Substring(0, 1).ToUpper() + pyName[i].Substring(1));
                                pySB.Append(String.IsNullOrEmpty(pySB.ToString()) || b ? s : separator + s);
                            }
                            // Console.WriteLine("µÚÁù½×¶Î:" + DateTime.Now.Ticks.ToString());
                        }
                    }
                    b = false;
                }
                // ·ÇÖĞÎÄ×Ö·û
                else
                {
                    pySB.Append(noWChar[j].ToString());
                }
            }
            // Console.WriteLine("µÚÆß½×¶Î:" + DateTime.Now.Ticks.ToString());
            return pySB.ToString();
        }
        /// <summary>
        /// ½«Ö¸¶¨ÖĞÎÄ×Ö·û´®×ª»»ÎªÆ´ÒôĞÎÊ½¡£
        /// </summary>
        /// <param name="chs">Òª×ª»»µÄÖĞÎÄ×Ö·û´®¡£</param>
        /// <param name="separator">Á¬½ÓÆ´ÒôÖ®¼äµÄ·Ö¸ô·û¡£</param>
        /// <returns>°üº¬ÖĞÎÄ×Ö·û´®µÄÆ´ÒôµÄ×Ö·û´®¡£</returns>
        public static string Convert(string chs, string separator)
        {
            return Convert(chs, separator, false);
        }
        /// <summary>
        /// ½«Ö¸¶¨ÖĞÎÄ×Ö·û´®×ª»»ÎªÆ´ÒôĞÎÊ½¡£
        /// </summary>
        /// <param name="chs">Òª×ª»»µÄÖĞÎÄ×Ö·û´®¡£</param>
        /// <param name="initialCap">Ö¸¶¨ÊÇ·ñ½«Ê××ÖÄ¸´óĞ´¡£</param>
        /// <returns>°üº¬ÖĞÎÄ×Ö·û´®µÄÆ´ÒôµÄ×Ö·û´®¡£</returns>
        public static string Convert(string chs, bool initialCap)
        {
            return Convert(chs, String.Empty, initialCap);
        }
        /// <summary>
        /// ½«Ö¸¶¨ÖĞÎÄ×Ö·û´®×ª»»ÎªÆ´ÒôĞÎÊ½¡£
        /// </summary>
        /// <param name="chs">Òª×ª»»µÄÖĞÎÄ×Ö·û´®¡£</param>
        /// <returns>°üº¬ÖĞÎÄ×Ö·û´®µÄÆ´ÒôµÄ×Ö·û´®¡£</returns>
        public static string Convert(string chs)
        {
            return Convert(chs, String.Empty);
        }
        /// <summary>
        /// Ö»×ª»»Ã¿¸öºº×ÖÊ××ÖÄ¸£¨´óĞ´£©
        /// </summary>
        /// <param name="strText">Òª×ª»»µÄÄÚÈİ</param>
        /// <returns>·µ»ØÃ¿¸öºº×ÖÊ××ÖÄ¸£¨´óĞ´£©</returns>
        public static string GetChineseSpell(string cnChar)
        {
            // Console.WriteLine("µÚÒ»½×¶Î:" + DateTime.Now.Ticks.ToString());
            // ´æ·Åºº×Ö(Ë«×Ö½Ú)µÄ×Ö½Ú
            byte[] array = new byte[2];
            StringBuilder pySB = new StringBuilder();
            int chrAsc = 0;
            int i1 = 0;
            int i2 = 0;
            char[] noWChar = cnChar.ToCharArray();
            CultureInfo ci = Thread.CurrentThread.CurrentCulture;
            TextInfo ti = ci.TextInfo;
            // ±éÀú×Ö·û´®ÖĞµÄ¸÷¸ö×Ö·û
            for (int j = 0; j < noWChar.Length; j++)
            {
                // ÅĞ¶ÏÊÇ·ñÊÇÖĞÎÄ×Ö·û

                if (regex.IsMatch(noWChar[j].ToString()))
                {
                    array = System.Text.Encoding.Default.GetBytes(noWChar[j].ToString(CultureInfo.InvariantCulture));
                    i1 = (short)(array[0]);
                    i2 = (short)(array[1]);

                    // »ñÈ¡ºº×Ö»úÄÚÂë
                    chrAsc = i1 * 256 + i2 - 65536;

                    // Console.WriteLine("Òª²éÕÒµÄºº×ÖµÄ»úÄÚÂëÊÇ: " + chrAsc.ToString() );
                    // ÅĞ¶ÏÊÇ·ñ³¬¹ıGB2312-80±ê×¼ÖĞµÄºº×Ö·¶Î§.¶Ô·Çºº×ÖÖ±½Ó·µ»Ø
                    if (chrAsc > lastChCode || chrAsc < firstChCode)
                    {
                        pySB.Append(ti.ToTitleCase(noWChar[j].ToString()));
                    }
                    else
                    {
                        string s = noWChar[j].ToString(CultureInfo.InvariantCulture);

                        // ²éÑ°Òª½âÎöµÄºº×ÖÔÚ²Î¿¼ºº×ÖÊı×éÖĞµÄÎ»ÖÃ
                        int stard = Array.IndexOf(referenceChinese, s);

                        // Èç¹ûÒª½âÎöµÄºº×Ö²»´æÔÚÓÚ²Î¿¼Êı×éÖĞ
                        if (stard == -1)
                        {
                            /*
                             * ¶¨ÒåÒ»¸öÓë²Î¿¼Êı×éÍêÈ«ÏàÍ¬µÄÊı×é,µ«ÔÚ±È²Î¿¼Êı×é¶àÒ»¸ö¿Õ×Ö·û,ÓÃÓÚ´æ·ÅÒª½âÎöµÄºº×Ö.
                             * ¶Ô´ËĞÂµÄÊı×éÖØĞÂÅÅĞò,¾ÍÄÜµÃµ½½âÎöºº×ÖÔÚ²Î¿¼ºº×ÖÖĞµÄÎ»ÖÃ.
                             * ÓÉÓÚ´ËĞÂÊı×éÔÚÖØĞÂÅÅĞòÇ°ÊÇ°´a~zÍêÈ«ÅÅºÃĞòµÄ,
                             * ËùÒÔ½âÎöºº×ÖÓëĞÂÊı×éÇ°ÃæµÄºº×ÖµÄÉùÄ¸ÊÇÒ»ÑùµÄ.
                             * È¡³öÇ°ÃæµÄ²Î¿¼ºº×ÖµÄÉùÄ¸¾ÍÊÇÒª½âÎöºº×ÖµÄÉùÄ¸.
                             */
                            string[] newArray = new string[] { "ß¹", "°Ë", "àê", "ßÕ", "åí", "·¢", "ê¸", "îş", "Ø¢", "ßÇ", "À¬", "Âè", "ÄÃ", "àŞ", "Å¿", "Æß", "òÅ", "Øí", "Ëû", "ÍÛ", "Ï¦", "Ñ¾", "ÔÑ", "" };
                            newArray[23] = s;
                            Array.Sort(newArray);

                            int i = Array.IndexOf(newArray, s);
                            pySB.Append(ti.ToTitleCase(pinYinArray[i - 1]));
                        }
                        // Èç¹ûÒª½âÎöµÄºº×Ö´æÔÚÓÚ²Î¿¼Êı×éÖĞ
                        else
                        {
                            int i = Array.IndexOf(referenceChinese, s);
                            pySB.Append(ti.ToTitleCase(pinYinArray[i]));
                        }
                    }
                }
                // ·ÇÖĞÎÄ×Ö·û,²»×÷´¦Àí,Ö±½Ó·µ»Ø
                else
                {
                    pySB.Append(ti.ToTitleCase(noWChar[j].ToString()));
                }
            }
            // Console.WriteLine("µÚÆß½×¶Î:" + DateTime.Now.Ticks.ToString());
            return pySB.ToString();
        }
        /// <summary>
        /// »ñµÃµÚÒ»¸öºº×ÖµÄÊ××ÖÄ¸£¨´óĞ´£©£»
        /// </summary>
        /// <param name="cnChar">Òª×ª»»µÄÄÚÈİ</param>
        /// <returns>µÚÒ»¸öºº×ÖµÄÊ××ÖÄ¸£¨´óĞ´£©</returns>
        public static string getSpell(string cnChar)
        {
            return !string.IsNullOrEmpty(cnChar) ? GetChineseSpell(cnChar).Substring(0, 1) : string.Empty;
        }


        /// <summary>
        /// ºº×Ö×ª»»³ÉÈ«Æ´µÄÆ´Òô
        /// </summary>
        /// <param name="Chstr">ºº×Ö×Ö·û´®</param>
        /// <returns>×ª»»ºóµÄÆ´Òô×Ö·û´®</returns>
        public string convertCh(string Chstr)
        {
            Regex reg = new Regex("^[\u4e00-\u9fa5]$");//ÑéÖ¤ÊÇ·ñÊäÈëºº×Ö
            byte[] arr = new byte[2];
            string pystr = "";
            int asc = 0, M1 = 0, M2 = 0;
            char[] mChar = Chstr.ToCharArray();//»ñÈ¡ºº×Ö¶ÔÓ¦µÄ×Ö·ûÊı×é
            for (int j = 0; j < mChar.Length; j++)
            {
                //Èç¹ûÊäÈëµÄÊÇºº×Ö
                if (reg.IsMatch(mChar[j].ToString()))
                {
                    arr = System.Text.Encoding.Default.GetBytes(mChar[j].ToString());
                    M1 = (short)(arr[0]);
                    M2 = (short)(arr[1]);
                    asc = M1 * 256 + M2 - 65536;
                    if (asc > 0 && asc < 160)
                    {
                        pystr += mChar[j];
                    }
                    else
                    {
                        switch (asc)
                        {
                            case -9254:
                                pystr += "Zhen"; break;
                            case -8985:
                                pystr += "Qian"; break;
                            case -5463:
                                pystr += "Jia"; break;
                            case -8274:
                                pystr += "Ge"; break;
                            case -5448:
                                pystr += "Ga"; break;
                            case -5447:
                                pystr += "La"; break;
                            case -4649:
                                pystr += "Chen"; break;
                            case -5436:
                                pystr += "Mao"; break;
                            case -5213:
                                pystr += "Mao"; break;
                            case -3597:
                                pystr += "Die"; break;
                            case -5659:
                                pystr += "Tian"; break;
                            default:
                                for (int i = (pyValue.Length - 1); i >= 0; i--)
                                {
                                    if (pyValue[i] <= asc) //ÅĞ¶Ïºº×ÖµÄÆ´ÒôÇø±àÂëÊÇ·ñÔÚÖ¸¶¨·¶Î§ÄÚ
                                    {
                                        pystr += pyName[i];//Èç¹û²»³¬³ö·¶Î§Ôò»ñÈ¡¶ÔÓ¦µÄÆ´Òô
                                        break;
                                    }
                                }
                                break;
                        }
                    }
                }
                else//Èç¹û²»ÊÇºº×Ö
                {
                    pystr += mChar[j].ToString();//Èç¹û²»ÊÇºº×ÖÔò·µ»Ø
                }
            }
            return pystr;//·µ»Ø»ñÈ¡µ½µÄºº×ÖÆ´Òô
        }
    }


}